Revit 2027 API
TargetRebarEdge Properties
The TargetRebarEdge type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TargetEdgeIndex |  Identifies the index of the target Rebar's edge. The index is a number between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
TargetRebarId |  Identifies the id of the target Rebar.
Top
See Also
Reference
TargetRebarEdge Class
Autodesk.Revit.DB.Structure Namespace